app/controllers/santa/events_controller.rb

  def create
    event.user_id = current_user&.id
    if event.save
---
INSERT INTO "events" ("created_at", "updated_at", "location", "date", "maximum_price", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2019-12-06 12:39:56.247695"], ["updated_at", "2019-12-06 12:39:56.247695"], ["location", "saint-etienne"], ["date", "2019-11-06 12:27:00"], ["maximum_price", 300], ["user_id", 1]]

  def validate_participants
    participant_params.each do |participant|
      participant = event.participants.build \
        name:   participant.last["name"],
        email:  participant.last["email"]
      participant.save
---
INSERT INTO "participants" ("created_at", "updated_at", "event_id", "name", "email") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-12-06 13:49:43.123100"], ["updated_at", "2019-12-06 13:49:43.123100"], ["event_id", 11], ["name", "rr"], ["email", "nohiken42@gmail.com"]]

  def shuffle_participants
    participants = event.participants.to_a.uniq.sort_by { rand }
    participants.each.with_index(1) do |participant, index|
      if index == participants.size
        participant.participant_id = participants[0].id
      else
        participant.participant_id = participants[index].id
      end
      participant.save
---
SELECT "participants".* FROM "participants" WHERE "participants"."event_id" = $1  [["event_id", 15]]
SELECT COUNT(*) FROM "participants" WHERE "participants"."event_id" = $1  [["event_id", 15]]
UPDATE "participants" SET "updated_at" = $1, "participant_id" = $2 WHERE "participants"."id" = $3  [["updated_at", "2019-12-06 14:08:38.826190"], ["participant_id", 46], ["id", 44]]

  def send_email_to_participants
    user = User.find(event.user_id)
    event.participants.each do |participant|
      destinataire = Participant.find(participant.participant_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "participants".* FROM "participants" WHERE "participants"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]